package calc.operations;

public interface Calculator {
    /**
     * метод result возвращает строковое представление результата вычислений.
     *
     * @param param это массив строк, который принимает метод.
     *              В рамках задачи это две строки с числами и третья- с оператором,
     *              будет реализован в классах данного пакета.
     *              Функциональность может быть расширена.
     *
     *
     * @return
     */

     String result(String[] param);
}
